app/Controllers/AuthController.php

SELECT *
FROM `tbl_users`
WHERE `username` = 'saeba'
 LIMIT 1
---
    public function loginProcess()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();

SELECT *
FROM `tbl_users`
WHERE `username` = 'saeba'
 LIMIT 1
UPDATE `tbl_users` SET `reset_token` = 'fd3e7416ad81f5058290ec557cf6b095295bd3cf71c212781eb63d6849852ecf', `reset_expires_at` = '2026-09-30 18:24:33', `updated_at` = '2026-09-30 17:24:33'
WHERE `tbl_users`.`id` IN ('6')
---
    public function sendResetToken()
    {
        $username = $this->request->getPost('username');

        // Cari user murni berdasarkan username
        $user = $this->userModel->where('username', $username)->first();

        if (!$user) {
            return redirect()->back()->withInput()->with('error', 'Username tidak ditemukan!');
        }

        // Generate Token Unik & Kedaluwarsa 1 Jam
        $token     = bin2hex(random_bytes(32));
        $expiresAt = date('Y-m-d H:i:s', strtotime('+1 hour'));

        $this->userModel->update($user['id'], [
            'reset_token'      => $token,
            'reset_expires_at' => $expiresAt
        ]);

SELECT *
FROM `tbl_users`
WHERE `reset_token` = 'fd3e7416ad81f5058290ec557cf6b095295bd3cf71c212781eb63d6849852ecf'
AND `reset_expires_at` >= '2026-09-30 17:24:38'
 LIMIT 1
---
    public function resetPassword($token)
    {
        $user = $this->userModel->where('reset_token', $token)
                                ->where('reset_expires_at >=', date('Y-m-d H:i:s'))
                                ->first();

SELECT *
FROM `tbl_users`
WHERE `reset_token` = 'fd3e7416ad81f5058290ec557cf6b095295bd3cf71c212781eb63d6849852ecf'
 LIMIT 1
UPDATE `tbl_users` SET `password` = '$2y$10$YZ0P6cfoQe6cmkRiFK/mWexiSuTRzP4zyTAsd9XCHu3LRiMY/xWzS', `reset_token` = NULL, `reset_expires_at` = NULL, `updated_at` = '2026-09-30 17:25:05'
WHERE `tbl_users`.`id` IN ('6')
---
    public function updatePassword()
    {
        $token          = $this->request->getPost('token');
        $passwordBaru   = $this->request->getPost('password');
        $konfirmasiPass = $this->request->getPost('confirm_password');

        if ($passwordBaru !== $konfirmasiPass) {
            return redirect()->back()->with('error', 'Konfirmasi password tidak cocok!');
        }

        $user = $this->userModel->where('reset_token', $token)->first();

        if (!$user) {
            return redirect()->to('/login')->with('error', 'Token tidak valid!');
        }

        // Update password & hapus token
        $this->userModel->update($user['id'], [
            'password'         => password_hash($passwordBaru, PASSWORD_BCRYPT),
            'reset_token'      => null,
            'reset_expires_at' => null
        ]);